{"default_url":null,"content":{"state":0,"taskInstructions":null,"references":[],"isTaskInstructionsVisible":true,"isCommentMandatory":false,"fields":[],"masterFinding":{"id":837,"exploitInstructions":"","verificationInstructions":"<b>Verification Instructions</b><br><br>Determine what the session cookies are for the application. Authenticate to the application and check for \"Set-Cookie:\" in the HTTP response. If the cookie does not contain the text \"HTTPOnly\", then this finding is verified. <br><br>Note: This is only necessary for session cookies or cookies that appear to contain some sensitive information.<br><br><b>Reporting Requirements</b><br><br><ol><li>Show login request and response - highlight the Set-Cookie header that does not set HTTPOnly for the session cookie</li><br></ol><br>","remediationInstructions":"Ensure that the HTTPOnly flag is set for all cookies that contain sensitive information. The HTTPOnly flag can be set either in application code or in the web server configurations.<br><br>The following examples illustrate how to set the HTTPOnly flag in some widely used web application configurations. For specific instructions, please refer to the server or programming language manual.<br><br>To set the HTTPOnly flag for all cookies in IIS, insert the following code to the web.config inside the system.web tag:<br><code>&lt;httpCookies httpOnlyCookies=\"true\" requireSSL=\"true\"/&gt;<br></code><br>Note that the code above also sets the secure flag for all cookies.<br><br>To set the HTTPOnly flag for all cookies in Tomcat 6.0 and newer, insert the following code to the context.xml file:<br><code>&lt;Context useHttpOnly=\"true\"&gt;...&lt;/Context&gt;<br></code><br><br>To set the HTTPOnly flag for all cookies in Servlet 3.0, insert the following code to the web.xml file:<br><code>&lt;session-config&gt;<br> &lt;cookie-config&gt;<br>  &lt;http-only&gt;true&lt;/http-only&gt;<br> &lt;/cookie-config&gt;<br>&lt;/session-config&gt;<br></code><br><br>To set the secure flag for a specific cookie within the application code:<br><ul><li>ASP.NET:</li><br></ul><br><code>HttpCookie cookie = new HttpCookie('cookiename');<br>cookie.HttpOnly = True; <br></code><br><ul><li>Java:</li><br></ul><br><code>String sessionid = request.getSession().getId();<br>response.setHeader(\"SET-COOKIE\", \"JSESSIONID=\" + sessionid + \"; HttpOnly\");<br></code><br><br>For SiteMinder make the Web Agent set the HTTP-Only attribute for any cookies it creates using the following parameter:<br><code>UseHTTPOnlyCookies<br></code><br>This parameter instructs the Web Agent to set the HTTP-only attribute on the cookies it creates. The default setting for this parameter is NO. To safeguard the information in cookies, set the value of the UseHTTPOnlyCookies parameter to yes.<br>","name":"Missing Cookie Flag - HTTPOnly","sourceId":"GID:3237","severity":"Low","businessImpact":"The lack of HTTPOnly cookies increases the risk of exposure or manipulation of sensitive cookie data through cross-site scripting attacks.  Cookie manipulation or exposure can allow an attacker to steal a user's session and gain access to their account.<br>","description":"One or more cookies were discovered that did not have the HTTPOnly flag set. This security feature helps mitigate the possibility of a successful cross-site scripting attack by not allowing cookies with the HTTPOnly attribute to be accessed through client-side scripts.<br>"}}}