{"default_url":null,"content":{"state":0,"taskInstructions":null,"references":[],"isTaskInstructionsVisible":true,"isCommentMandatory":false,"fields":[],"masterFinding":{"id":841,"exploitInstructions":"","verificationInstructions":"<b>Verification Instructions</b><br><br>Determine what the session cookies are for the application. Authenticate to the application and check for \"Set-Cookie:\" in the HTTP response. If the cookie does not contain the text \"Secure\", then this finding is verified. <br><br>Note: This is only necessary for session cookies or cookies that appear to contain some sensitive information.<br><br>The following example shows the Set-Cookie header with the secure flag set:<br><br>Set-Cookie: NAME=VALUE; expires=DATE; path=PATH; domain=DOMAIN_NAME; secure <br><br>Secure flag cannot be used for HTTP applications. If Cleartext Protocol - HTTP is reported, this finding should be included but a note should be added to state that the client should ensure that Secure flag is set after the site has been switched over to HTTPS.<br><br><b>Reporting Requirements</b><br><br><ol><li>Show login request and response - highlight the Set-Cookie header that does not set Secure flag for the session cookie</li><br></ol><br>","remediationInstructions":"Ensure that the secure flag is set for all cookies that contain sensitive information. The secure flag can be set either in application code or in the web server configurations.<br><br>The following examples illustrate how to set the secure flag in some widely used web application configurations. For specific instructions, please refer to the server or programming language manual.<br><br>To set the secure flag for all cookies in IIS, insert the following code to the web.config inside the system.web tag:<br><code>&lt;httpCookies httpOnlyCookies=\"true\" requireSSL=\"true\"/&gt;<br></code><br>Note that the code above also sets the HTTPOnly flag for all cookies.<br><br>To set the secure flag for all cookies in Tomcat 6.0.19 and newer, set the following code to the web.xml file inside the Connector tag:<br><code>secure=\"true\"<br></code><br><br>To set the secure flag for a specific cookie within the application code:<br><ul><li>JSP:</li><br></ul><br><code>Cookie cookienameCookie = new Cookie(\"cookiename\",text);<br>cookienameCookie.setSecure(true);<br></code><br><ul><li>JavaScript:</li><br></ul><br><code>document.cookie = \"name = value;secure\";<br></code><br><ul><li>ASP.NET:</li><br></ul><br><code>HttpCookie cookie = new HttpCookie('cookiename');<br>cookie.Secure = True;  <br></code><br><br>For SiteMinder make the Web Agent send session cookies between a protected web server and the requesting browser over secure (HTTPS) connections using the following parameter:<br>UseSecureCookies<br>Enable this parameter to increase security between browsers and web servers. The default setting for this parameter is No. To send cookies over SSL connections, set the UseSecureCookies parameter to yes.<br>When this setting is enabled, users in single sign-on environments who move from an SSL web server to a non-SSL web server will have to re-authenticate. Secure cookies cannot be passed over traditional HTTP connections.<br>","name":"Missing Cookie Flag - Secure","sourceId":"GID:3186","severity":"Low","businessImpact":"If an application uses both HTTPS and HTTP, but does not set the secure flag, cookies set during an HTTPS request will also be sent during subsequent HTTP requests. Attackers can then compromise the cookie by sniffing the unencrypted network traffic.","description":"A cookie was found that does not require the use of SSL for secure transmission. Any area of a website or web application that contains sensitive information or access to privileged functionality such as remote site administration should require that all cookies to be sent via SSL during a SSL session. If a cookie is marked secure, it will only be transmitted if the communications channel with the host is a secure one. If secure flag is not specified, a cookie is considered safe to be sent in the clear over unsecured channels.<br>"}}}