{"default_url":null,"content":{"state":0,"taskInstructions":null,"references":[],"isTaskInstructionsVisible":true,"isCommentMandatory":false,"fields":[],"masterFinding":{"id":17051124,"exploitInstructions":"","verificationInstructions":"<b>Verification Instructions</b><br><br>Use the forgot password functionality (if available) to see if new password is sent in an email.<br><br>If the password meets complexity requirements and users are required to change it after one use, the finding should not be reported. Strong OTP is as strong as a reset token.<br><br><b>Reporting Requirements</b><br><ol><li>Show forgot password functionality</li><br><li>Show the email containing a password - redact the password</li><br></ol><br>","remediationInstructions":"Implement the following password recovery process:<br><ol><li>Allow users to start the password recovery process by entering their email address on the reset page.</li><br><li>Require users to fill in a captcha and return a message stating &quot;Your request has been processed&quot; for both valid and non-existing user accounts.</li><br><li>Send an email to the user containing a URL with a unique, one-time token. The token links the password reset request to the user's account. The token should expire in 15 minutes or less.</li><br><li>The password reset page should not authenticate the user to the application; it should only allow a password reset.</li><br><li>Require correct answers to security questions on the password reset page.</li><br><li>Invalidate the token after it has been used once.</li><br></ol><br>","name":"Weak Password Reset - Password in Email","sourceId":"M:30ca6c46-abb2-e211-b9cf-001e4f12001e","severity":"Medium","businessImpact":"Were an attacker able to access the victim's email, it could be possible to access the affected application by using these credentials via the password reset functionality.","description":"Passwords are sent in clear text via email to users during the password reset process.<br>"}}}