{
    "content": {
        "fields": [
        ],
        "isCommentMandatory": false,
        "isTaskInstructionsVisible": true,
        "masterFinding": {
            "businessImpact": "Weak password reset or recovery functionality may allow attackers to gain unauthorized access to application user accounts.  ",
            "description": "The password recovery process is currently missing best practice security controls.<br>",
            "exploitInstructions": "",
            "id": 2989394,
            "name": "Weak Password Reset or Recovery Functionality",
            "remediationInstructions": "Implement the following password recovery process:<br><ol><li>Allow users to start the password recovery process by entering their email address on the reset page.</li><br><li>Require users to fill in a captcha and return a message stating &quot;Your request has been processed&quot; for both valid and non-existing user accounts.</li><br><li>Send an email to the user containing a URL with a unique, one-time token. The token links the password reset request to the user's account. The token should expire in less than 3 hours but a shorted expiration time, like 15 minutes, is recommended.</li><br><li>The password reset page should not authenticate the user to the application; it should only allow a password reset.</li><br><li>Invalidate the token after it has been used once.</li><br></ol><br>",
            "severity": "Medium",
            "sourceId": "M:2989394",
            "verificationInstructions": "<b>Verification Instructions</b><br><br>Check if any of the following best practices are missing. The lack of CAPTCHA, by itself, does not warrant a vulnerability.<br><ol><li>Allow users to start the password recovery process by entering their email address on the reset page.</li><br><li>Require users to fill in a captcha, and return a message stating &quot;Your request has been processed&quot; for both valid and non-existing user accounts.</li><br><li>Send an email to the user containing an URL with a unique, one-time token. The token links the password reset request to the user's account. The token should expire in 15 minutes or less. However, expiration up to 3 hours is acceptable but a shorter expiration is recommended.</li><br><li>The password reset page should not authenticate the user to the application; it should only allow a password reset.</li><br><li>Invalidate the token after it has been used once.</li><br></ol><br><b>Reporting Requirements</b><br><ol><li>Add an explanation how the password reset process works in the application and which controls are missing</li><br><li>Add screenshots for each step of the password reset process highlighting the weaknesses</li><br></ol><br>"
        },
        "references": [
        ],
        "state": 0,
        "taskInstructions": null
    },
    "default_url": null
}