{"default_url":null,"content":{"state":0,"taskInstructions":null,"references":[],"isTaskInstructionsVisible":true,"isCommentMandatory":false,"fields":[],"masterFinding":{"id":688826,"exploitInstructions":"","verificationInstructions":"<b>Verification Instructions</b><br><br>Remember Me functionality is typically implemented by setting a custom cookie. Inspect the cookie value and try to see if any of the following are true:<br><ol><li>cookie value is static (try setting it multiple times using same credentials)</li><br><li>cookie value contains sensitive information</li><br><li>cookie value is encrypted</li><br></ol><br>If the way that the cookie is constructed can be figured out, try manipulating the cookie to gain access to the application or the data in the cookie.<br><br>Remember Me functionality that allows access to the application without a password cannot be implemented securely. The best way to do it is to mark session cookie persistent; however, then persistent session cookie should be reported along with an explanation regarding Remember Me functionality.<br><br><b>Reporting Instructions</b><br><ol><li>Add an explanation why the remember me functionality is weak</li><br><li>Show login page with remember me selected</li><br><li>Show the HTTP response - highlight the remember me cookie</li><br></ol><br>","remediationInstructions":"Do not allow the remember me function to store credentials locally on the user's computer.  If remember me functionality is required, ensure the persistent token/cookie is destroyed upon the user logging out. Similarly, the persistent token/cookie should be invalidated after a definite life span. Alternatively, remember me functionality can be implemented with specific function(s) of the application that does not involve sensitive information per business requirement. Any access to function(s) involving sensitive data should prompt user to manually enter the password.<br>","name":"Weak Remember Me Functionality","sourceId":"M:688826","severity":"High","businessImpact":"Exploitation of this issue would allow the attacker to take any action within the application within the context of the user whose access was compromised.","description":"The remember me functionality saves either user credentials or a static token locally on the user's computer. Were an attacker to gain access to the locally cached credentials or static token, or physical access to a computer which had remember me functionality turned on, the attacker could gain unauthorized access to the application.<br>"}}}