{"default_url":null,"content":{"state":0,"taskInstructions":null,"references":[],"isTaskInstructionsVisible":true,"isCommentMandatory":false,"fields":[],"masterFinding":{"id":17058626,"exploitInstructions":"","verificationInstructions":"<h3><b>Verification Instructions:</b></h3><br>The client must use <b>either</b> a complexity-based policy <b>or</b> the NIST-based policy; they are not required to use both. Only proceed to test the NIST policy if you are sure they are using NIST-based rather than complexity-based.<br><br><ol><li>Implementing password policy client-side <b>is</b> sufficient as it prevents normal users from using weak passwords.</li><br><li>Attempt to change password to a weak password.</li><br></ol><br><b>Complexity-based weak passwords:</b><br><ol><li>Less than eight characters</li><br><li>Do not contain sufficient complexity - at least three of the following required: </li><br><li class='depth1'>lowercase</li><br><li class='depth1'>uppercase</li><br><li class='depth1'>number</li><br><li class='depth1'>special character</li><br></ol><br>If you are sure (or they have stated) they are using NIST, then attempt to set one of the following passwords:<br><b>NIST-based weak passwords:</b><br>a)  root@123<br>b) password123<br>c) L3tm31n!<br>If any of these three passwords is accepted, sufficient cross-checking with a list of known compromised passwords is not performed.<br><br><h3>Reporting Instructions:</h3><br><ol><li>Include which of the 2 policies the application is using.</li><br><li>Include a description stating which characteristic(s) of that policy is not being adhered to.</li><br></ol><br><h3></h3><br><h3><b>Variation: AWS Cloud Pen Test</b></h3><br>1. Under the IAM section of the console, select Account Settings. <br>2. Review the password policy against our recommendations.<br>","remediationInstructions":"Ensure that the password policy is configured securely, following best practices and regulatory requirements. Choose a password policy, <b>either</b> NIST recommendation <b>or</b> complexity-based password policy, that can be implemented within the organization. Note that the NIST implementation must satisfy <b>all</b> of the NIST characteristics.<br> <br><b>NIST Special Publication 800-63B: 5.1.1.2 Memorized Secret Verifiers</b>:<br><ul><li>Length: 8 character minimum, &gt;64-character maximum</li><br><li>Compare new passwords to a dictionary and do not allow common, easily guessed passwords (such as password, abcd1234, etc.)</li><br><li>Compare new passwords to a list of known compromised passwords; do not allow the use of previously compromised passwords</li><br><li>Allow all printing ASCII and Unicode characters + spaces</li><br><li>Should offer option to show password rather than dots or asterisks; helps typing accuracy</li><br><li>Do not enforce composition rules (i.e., no &quot;passwords must include uppercase and lowercase letters, a number...&quot;, etc.); such rules provide a poor user experience</li><br><li>Do not use password hints; they weaken authentication</li><br><li>Do not expire passwords arbitrarily; regular expiration encourages users to choose easy-to-guess, less secure passwords</li><br><li>Do not use Knowledge-based Authentication (KBA)</li><br></ul><br><b>Complexity-Based Password Policy:</b><br>At a minimum, the password policy should adhere to the following rules:<br><br><ul><li>The password is alphanumeric and contain both letters and numbers.</li><br><li>The password is a mix of uppercase and lowercase letters.</li><br><li>The password contains special characters such as &#35;,$</li><br><li>The password should not contain contextual information such as login credentials, website name</li><br><li>The password should be changed at least annually</li><br></ul><br>The password length is at least:<br><ul><li>15 characters for administrator and service accounts</li><br><li>12 characters for operating system user accounts</li><br><li>8 characters for application accounts</li><br></ul><br>","name":"Account Policy - Weak Password Policy","sourceId":"M:825c9ab2-b2f4-e511-80db-ecf4bbd04083","severity":"Medium","businessImpact":"Weak password policies may allow users to set an easy to guess password that can leveraged by an attacker to gain unauthorized access to systems, applications, and sensitive information.","description":"The password policy does not enforce strong passwords. This may allow users to set weak passwords. Weak passwords are commonly targeted during brute force password attacks.<br>"}}}