{"default_url":null,"content":{"state":0,"taskInstructions":null,"references":[],"isTaskInstructionsVisible":true,"isCommentMandatory":false,"fields":[],"masterFinding":{"id":751,"exploitInstructions":"","verificationInstructions":"<h3>Verification Requirements:</h3><br>Run the following tool against the in-scope endpoint(s).<br><br><b>(Recommended) Option: testssl.sh</b><br><a href='https://github.com/drwetter/testssl.sh'>https://github.com/drwetter/testssl.sh</a><br><code>./testssl.sh [host|host:port|URL|URL:port]<br>&#35; or for a specific protocol<br>./testssl.sh --starttls ftp &lt;IP&gt;:&lt;PORT&gt;<br></code><br><b>Option 2: Nmap</b><br><code>nmap --script ssl-enum-ciphers -p 443 x.x.x.x<br></code><br><h3>Reporting requirements:</h3><br>Report and highlight any of the following ciphers:<br><ul><li>Keys shorter than 128 bits</li><br><li>3DES</li><br><li>RC4</li><br><li>CBC ciphers</li><br><li>SHA/SHA-1</li><br><li>TLS ciphers that do not use GCM, CCM, or ChaCha20-Poly1305</li><br></ul><br>This can be downgraded to a <b><red>LOW</red></b> severity finding<b><red> if the only issue</red></b> is that the endpoint accepts CBC ciphers. If there are any issues in addition to CBC ciphers, this should stay as a MEDIUM.<br>","remediationInstructions":"Do not use any ciphers that have a key length less than 128 bits.<br>Do not use any ciphers that have known security weaknesses including: 3DES, RC4, and CBC ciphers.<br>Only use TLS ciphers that use GCM, CCM, or ChaCha20-Poly1305.<br>","name":"Weak Configuration - SSL/TLS - Weak Encryption Ciphers","sourceId":"GID:4558","severity":"Medium","businessImpact":"If an attacker decrypted communications sent over a connection secured with a deprecated protocol, the confidentiality of information sent over this connection would be compromised.<br>","description":"The SSL/TLS protocol supports several cipher suites, each providing a different level of security. The SSL/TLS protocol permits the server to support some or all these cipher suites and during the initial SSL/TLS session setup stage, it allows the client to pick the cipher suite to be used for that session. The hosts use certificates and public and private session keys to securely negotiate the cipher suite to be used.<br><br>Encryption ciphers that use keys shorter than 128 bits are considered cryptographically insecure. It may be possible to decrypt messages that have been encrypted with a weak cipher. Additionally, some encryption ciphers are considered insecure due to known weaknesses in their implementation, such as 3DES due to Sweet32, RC4 due to Bar Mitzvah, and CBC ciphers due to padding oracle attacks.<br><br>Weak SSL/TLS ciphers are not necessarily used by default when they are enabled. However, an attacker may be able to force an SSL/TLS connection to use weak ciphers. It should be noted that disabling weak ciphers prevents legacy browsers from successfully establishing an SSL/TLS connection.<br>"}}}