{"default_url":null,"content":{"state":0,"taskInstructions":"Note for WaPens: <br>This finding is intended for administration logins which provide access to control the web server such as Apache Tomcat Manager, phpMyAdmin, etc. This finding is not applicable if standard application users and privileged/administrator application users share the same login. This finding may be applicable if there is a separate login mechanisms for both standard users and administrator users.  <br>","references":[],"isTaskInstructionsVisible":true,"isCommentMandatory":false,"fields":[],"masterFinding":{"id":677,"exploitInstructions":"","verificationInstructions":"<b>Verification Instructions</b><br><br>Use automated tools to look for known or predictably named administration logins. Web server administrative logins typically should not be available to the Internet, and should be checked for default credentials. Appropriateness of administrative functionality elsewhere may depend on the business use case for the application and the sensitivity of the data - if exposed over the Internet, two-factor authentication may be necessary, and of course the security measures necessary for a regular login would also apply (HTTPS, username enumeration, etc.) <br><br>For PCI:<br>If an admin section is available externally, but has appropriate levels of encryption in place (SSL/TLS in use with no weak ciphers, no NULL ciphers, no SSL certificate issues, etc.), the PCI counsel has stated that it can be considered a false positive.<br><br><b>Reporting Requirements</b><br><ol><li>Screenshot admin login page</li><br></ol><br><b>Tools</b><br><br>fuzzdb contains predictable resource paths, including administrative login pages.<br>","remediationInstructions":"Disable external access to the administrative interface. Remote access to the interface should not be allowed directly. Instead, connections should be made via a bastion host, over a VPN connection, or through both.<br>","name":"Administrative Interface Externally Accessible","sourceId":"GID:2876","severity":"Medium","businessImpact":"An attacker could perform brute force attacks against the administration page and potentially gain unauthorized access to any data or functionality the administrative interface provides.","description":"A login page to administrative functionality was discovered. Having an administrative interface available externally increases exposure to a potentially malicious attack on the target host, as well as the likelihood of a successful instance of unauthorized access.<br>"}}}