{"default_url":null,"content":{"state":0,"taskInstructions":null,"references":[],"isTaskInstructionsVisible":true,"isCommentMandatory":false,"fields":[],"masterFinding":{"id":21930,"exploitInstructions":"Attempt to read source code, configuration, and log files to identify password or vulnerabilities that will provide command execution on the affected system.","verificationInstructions":"<b>Verification Instructions</b><br><br>Identify parameters that appear to be used to denote files or folders on the server. Inject path traversal sequences in an attempt to determine if path traversal is possible and to escape the intended file location.<br><br>No error on vulnerable system (same as file=test.doc):<br>file=./test.doc<br>file=.\\test.doc<br><br>Error on vulnerable system (file does not exist):<br>file=../test.doc<br>file=..\\test.doc<br><br>Test if the application display directory listings if parameter is modified to be a folder:<br>file=./<br>file=.\\<br><br>Attempt to access known files:<br>file=..\\..\\..\\..\\web.config<br>file=../../../../etc/passwd<br><br>Additionally, on Windows systems, try UNC paths to connect to remote resources. If UNC paths are accepted, try connecting to externally available pentester controled servers.<br><br>If plain traversal sequences do not work use Burp Intruder to determine if encoded etc. path traversal sequences can be used:<br><ol><li>Send request to Intruder and mark injection point</li><br><li>Select Fuzzing - Path Traversal template</li><br><li>Create Payload Processing rule Match/Replace</li><br><li>Replace {FILE} with known file (Linux/Unix or Windows)</li><br><li>Example: Match regex: \\{FILE\\}</li><br><li>Example: Replace with: etc/passwd</li><br></ol><br><br>You can also use  PWNWIKI for a list of common file paths:<br><ul><li>Windows - http://pwnwiki.io/&#35;!presence/windows/blind.md</li><br><li>Linux - http://pwnwiki.io/&#35;!presence/linux/blind.md</li><br></ul><br><b>Reporting Requirements</b><br><ol><li>Screenshot the initial page</li><br><li>Show the normal HTTP request</li><br><li>Show directory traversal sequence in request parameter</li><br><li>Show access to files that are not normally accessible via the web site</li><br></ol><br><b>Further Testing</b><br><br>If directory traversal vulnerabilities found, attempt to gain access to files that contain sensitive information. Potential findings:<br><ul><li>Cleartext password in files</li><br><li>Insufficient egress filtering</li><br></ul><br>","remediationInstructions":"Ensure that all data used by the application is put through a data input filter that removes potentially harmful characters. Best practice recommends the use of allow lists using regular expressions.<br><br>A non-privileged service account should be used to run the web server. Following the principle of least privilege when assigning permissions for the service account helps limit the impact of a successful directory traversal attack.<br>","name":"Directory Traversal","sourceId":"M:21930","severity":"High","businessImpact":"Successful exploitation of the directory traversal vulnerability allows an attacker to access files located on the targeted server. This may result in disclosure of sensitive information, such as user credentials, and thus result in further compromise of the affected system.<br>Directory traversal vulnerabilities affecting file creation functionality may allow a malicious user to create and possibly overwrite files which could compromise the confidentiality, integrity, and availability of the affected system.<br>","description":"The application uses unsanitized user input to access files on the affected system. By injecting path traversal sequences into the user input it is possible to gain unauthorized access to arbitrary files on the system.<br>"}}}