{"default_url":null,"content":{"state":0,"taskInstructions":null,"references":[],"isTaskInstructionsVisible":true,"isCommentMandatory":false,"fields":[],"masterFinding":{"id":688753,"exploitInstructions":null,"verificationInstructions":"<b>Verification Instructions</b><br><br>Identify parameters that could be used in LDAP queries. Login or search forms are the most typical uses for LDAP queries from web applications.<br><br>Attempt to cause errors or unexpected results by injecting LDAP special characters: ), (, |, &#42;, !, &amp;.<br><br>If LDAP injection detected, attempt to expand the query result set. Typical injections:<br><ul><li>)(ou=&#42;</li><br></ul><br>user=&#42;)(uid=&#42;))(|(uid=&#42;<br><br>%00 can sometimes be used to comment out the rest of the query (OpenLDAP).<br><br><b>Reporting Requirements</b><br><ol><li>Screenshot the initial page</li><br><li>Show the normal HTTP request</li><br><li>Show LDAP injection in request parameter</li><br><li>Show the impact of LDAP injection - typically authentication bypass or information enumeration</li><br></ol><br><br><b>Tools</b><br><br>If LDAP injection detected, LDAPBlindExplorer can be used to extract data:<br><ul><li>http://code.google.com/p/ldap-blind-explorer/</li><br></ul><br>","remediationInstructions":"The following recommendations will help reduce the risk of LDAP injection attacks:<br><ul><li>Ensure that the web application validates all input parameters (cookies, headers, query strings, forms, hidden fields, etc.) against a stringent definition of expected results. Allowlisting should be used as the base validation method of user input; blocklisting can be used as an additional layer of protection.</li><br><li>Whenever possible, limit all client-supplied data to alphanumeric data. If non-alphanumeric characters must be used, encode them as before passing them to the underlying query.</li><br></ul><br>","name":"LDAP Injection","sourceId":"M:688753","severity":"Medium","businessImpact":"A malicious user may be able to modify LDAP search queries which could lead to disclosure of sensitive data, thus compromising the confidentiality of the target system and its associated resources.","description":"LDAP injection was found within the application. LDAP injection is an attack that takes advantage of unsanitized user inputs that are used as part of LDAP queries. A malicious user may use LDAP injection to modify the dynamically generated LDAP query.<br>"}}}