{"default_url":null,"content":{"state":0,"taskInstructions":null,"references":[],"isTaskInstructionsVisible":true,"isCommentMandatory":false,"fields":[],"masterFinding":{"id":17055315,"exploitInstructions":"","verificationInstructions":"<b>Verification Instructions</b><br><br>Identify parameters in the application that can be modified to force the backend servers to connect to a remote resource. Try capturing connection and DNS requests with Burp Collaborator. If outbound connectivity is allowed, attempt to connect to NetSPI servers to capture authentication handshakes (both SMB and HTTP).<br><br>Sample:<br><br>https://website/login?username=uid&amp;password=pwd&amp;server=209.118.108.216<br><br>External Service Interaction (DNS) on URL/Host header, follow these steps to verify if it’s actually a finding:<br><ol><li>Inject arbitrary addresses (Collaborator URL, internal IPs, invalid DNS names) to URL/Host header</li><br><li>If the response comes from the “right” application regardless, the finding should be marked false</li><br></ol><br><b>Reporting Requirements</b><br><ol><li>Add an explanation what causes the connection</li><br><li>Add an explanation that only DNS traffic is allowed outbound but the vulnerability could be exploited to access internal systems</li><br><li>Show the initial page</li><br><li>Show request with modified parameters</li><br><li>Show captured traffic</li><br></ol><br><b>Tools</b><br><ul><li>Burp Collaborator</li><br><li>Responder</li><br><li>Inveigh</li><br></ul><br>","remediationInstructions":"Ensure sensitive endpoint information stays server-side and is not modifiable by the client. If clients must be able to control endpoint information, implement allow lists to ensure that connections can be made to approved endpoints only.<br>","name":"Server-Side Request Forgery - DNS Only","sourceId":"M:73c43cc0-0119-e511-80cc-ecf4bbd04073","severity":"Medium","businessImpact":"An attacker could potentially capture application server or endpoint credentials, or other sensitive information contained in the modified application request. ","description":"As part of the application workflow, the application established a connection to an external resource. It was possible to modify the endpoint for this resource and force the application server to attempt to access a different location. However, due to proper egress filtering external connections could not be established but the application performed name resolution for external sources and those DNS requests could be captured on external systems. In this situation, it will often be possible to use the relevant service to connect to other systems within the same organization, or to services available on the local loopback adapter of the application server itself.<br>"}}}