{"default_url":null,"content":{"state":0,"taskInstructions":null,"references":[],"isTaskInstructionsVisible":true,"isCommentMandatory":false,"fields":[],"masterFinding":{"id":488151,"exploitInstructions":"","verificationInstructions":"<b>Verification Instructions</b><br><br>Submit invalid values for parameter values. Use this finding if bad user input causes functional problems. For example, if adding invalid parameter values to user input breaks some application functionality. If actual attacks, such as XSS, can be exploited, then report those. <br><br><b>Reporting Requirements</b><br><ol><li>Show the initial page</li><br><li>Show request with invalid input</li><br><li>Show broken functionality</li><br><li>Add an explanation whether the issue affects only the current user or other users as well</li><br></ol><br>","remediationInstructions":"The following recommendations will help reduce the risk of special characters causing problems with the application behavior:<br><ul><li>Perform all input validation server-side.</li><br><li>Ensure that the web application validates all input parameters (cookies, headers, query strings, forms, hidden fields, etc.) against a stringent definition of expected results. Allow-listing should be used as the base validation method of user input; deny-listing can be used as an additional layer of protection.</li><br><li>Whenever possible, limit all client-supplied data to alphanumeric data. If non-alphanumeric characters must be used, encode them as HTML entities before using them in an HTTP response, so that they cannot be used to modify the structure of the HTML document.</li><br><li>Many server-side scripting languages provide built in methods to convert the value of the input variable into correct, non-interpretable HTML. These should be used to sanitize all input before displaying it to the client.</li><br></ul><br>","name":"Insufficient Input Validation","sourceId":"M:488151","severity":"Medium","businessImpact":"Insufficient input validation may allow unexpected or invalid user input to be entered into the application. Depending on the user input, it may interfere with the application logic, cause invalid data entries, or potentially break application functionality.<br>","description":"One or more areas in the application do not perform sufficient input validation, allowing users to submit unexpected input to the application.<br>"}}}