{"default_url":null,"content":{"state":0,"taskInstructions":null,"references":[],"isTaskInstructionsVisible":true,"isCommentMandatory":false,"fields":[],"masterFinding":{"id":21401,"exploitInstructions":"","verificationInstructions":"<b>Verification Instructions</b><br><br>Check if WSDL files, or other web services definitions, are available on the server.<br><br>WSDLs are typically identified by appending ?wsdl to the web service endpoint URL.<br><br>Example:<br>http://www.somehost.com/ws/GetData.asmx?wsdl<br><br>It can be something else, like .disco, as well.<br><br>Access to .svc files that give sample requests instead of full definitions can be helpful too.<br><br>If WSDLs are identified, use SoapUI or Burp WSDLer to construct valid web service requests and test them normally.<br><br><b>Reporting Requirements</b><br><ol><li>Screenshot access to web service definition</li><br></ol><br><b>Tools</b><br><ul><li>SoapUI - for generating SOAP requests from WSDLs</li><br><li>Burp WSDLer - for generating SOAP requests from WSDLs</li><br></ul><br>","remediationInstructions":"Do not unnecessarily expose web service definitions to unauthenticated sources. If unauthenticated access to the web service definitions is required, ensure that any web services that the definitions describe are protected by proper access controls in accordance with existing security policy.<br>","name":"Information Disclosure - Web Services Definition File","sourceId":"WI:10542","severity":"Low","businessImpact":"An attacker could bypass authentication control mechanisms and directly call web methods. This could lead to the discovery of other vulnerabilities within available web services.","description":"A web services description document has been discovered on the server. Definition files contain information about the web services methods that the server offers. An unintended exposure of this information can cause unauthorized access to server methods. It may be possible for an attacker to bypass the client application and make unauthorized requests to web services methods.<br>"}}}