{"default_url":null,"content":{"state":0,"taskInstructions":"Modify browser user agent to determine whether the application has a different web interface and potentially different backend functionality depending on the browser type.<br><br>Try normal web browser, iPhone, and Android user-agents. Also consider using search engine crawler User Agents, these sometimes allow access to authenticated pages.<br><br>With a little setup, you can run EyeWitness against a list of URLs and provide the <code>--cycle</code> flag with the appropriate type of user agents to try, such as \"Browser\", \"Mobile\", \"Crawler\", or even \"All\". Proxy through Burp Suite and use the Match & Replace to add headers/cookies for authenticated pages.<br><br>If additional application functionality is identified via user-agent switching, include identified functionality into the normal testing process (automated scanning and manual testing).<br><br><br>-- Description --<br><br>Web Applications will sometimes support and react to different User-Agents to provide compatibility or accessibility features based on the browser. For instance, mobile users may get a reduced window size with larger buttons that is more convenient for a touch screen. Different browsers support different features and render pages slightly differently, which can result in different pages being presented to the user. There is also the odd chance that the application will expose functionality to a client with a particular user agent.<br><br>Additionally, many web applications will allow crawling and indexing bots, such as Google or Bing, in to certain parts of the application which may otherwise require authentication; this can allow for bypasses and potentially expose sensitive information.<br><br><br>-- Tools --<br><br>Chrome / Firefox extension: User-Agent Switcher<br>Burp Suite: Proxy - Options - Match and Replace<br>https://tools.kali.org/web-applications/ua-tester<br>https://tools.kali.org/information-gathering/eyewitness<br>https://portswigger.net/burp/documentation/desktop/tools/proxy/options#match-and-replace","references":[],"isTaskInstructionsVisible":true,"isCommentMandatory":false,"fields":[],"masterFinding":null}}