{"default_url":null,"content":{"state":0,"taskInstructions":"As you're testing your application, keep an eye out for any references to AWS S3 resources:<br><ul><li>https://my-bucket.s3.us-west-2.amazonaws.com/puppy.png</li><br><li>https://s3.us-west-2.amazonaws.com/mybucket/puppy.jpg</li><br></ul><br>Note that the examples above are for the &quot;my-bucket&quot; S3 bucket, and the &quot;puppy.jpg&quot; file<br>See here for additional URL info - https://docs.aws.amazon.com/AmazonS3/latest/userguide/access-bucket-intro.html<br><br>There may also be DNS hostnames that point to S3 buckets. Keep an eye out for these as you may have to manually find the bucket name through your proxy logs.<br><br>Once you have a bucket identified, there are two ways to check for public permissions.<br><ol><li>Browse Anonymously</li><br><li>Try to list as an AWS IAM user</li><br></ol><br>To browse anonymously, just enter the bucket URL (https://s3.us-west-2.amazonaws.com/mybucket/) in your browser. If you get a list of file names (Keys), then it allows listing. If you can access the files, you have get actions enable as well.<br><br>For the IAM user, use an access key and secret (for a user in the NetSPI AWS account) to create a profile for the AWS CLI and execute the S3 ls command for the bucket to see if it allows all IAM users to list/access objects.<br><code>aws s3 ls s3://mybucket/<br></code><br>If you get back a list of files, the bucket allows authenticated principals to access the bucket.<br>","references":[],"isTaskInstructionsVisible":true,"isCommentMandatory":false,"fields":[],"masterFinding":{"id":17065048,"exploitInstructions":"","verificationInstructions":"Review the Scout reports for the Bucket ACLs.<br><br>If Authenticated Users is in the list, use a NetSPI session in the CLI and attempt a \"aws s3 ls s3://BUCKET_NAME\" listing command.<br>","remediationInstructions":"Review the permissions for the affected S3 buckets. Evaluate the need for anonymous access to the buckets. If applicable, review the need for the \"Authenticated Users\" group for the bucket.<br>","name":"Bucket with Public Permissions - S3 - AWS","sourceId":"M:04a721d0-e149-4ccd-9a9c-0d1d04b6c02f","severity":"High","businessImpact":"Depending on the access policies applied to the bucket, an attacker may be able to read, modify, and delete data in the S3 bucket. Additionally, an attacker with rights to edit permissions may be able to restrict access to existing data in the S3 bucket.<br><br>If the Authenticated Users group is utilized in the bucket ACLs, any user with an AWS account may have rights on the bucket, while an anonymous user might not have access. The Authenticated Users accounts are not restricted by the bucket's IAM accounts and could allow other AWS accounts to gain access to the buckets.<br>","description":"AWS Simple Storage Service (S3) allows users to register custom domains for their S3 buckets.  Misconfigured buckets will sometimes allow directory browsing, revealing the full file structure when the subdomain is directly browsed to.<br><br>The affected buckets allow for either anonymous or AWS authenticated (non-client accounts) users to access the data.<br>"}}}