{"default_url":null,"content":{"state":0,"taskInstructions":"This finding specifically relates to gaining access to the AWS metadata service (169.254.169.254) through command injection, or SSRF. If you are able to find either type of issue in an app in AWS, make an HTTP request to http://169.254.169.254 and see if you get a response. The metadata can expose credentials for any roles applied to the EC2 instance, so you may be able to use them for escalating into the AWS environment. Find a CPen resource if you end up gaining access to credentials.<br>","references":[],"isTaskInstructionsVisible":true,"isCommentMandatory":false,"fields":[],"masterFinding":{"id":17062481,"exploitInstructions":"","verificationInstructions":"If you can find a reflected SSRF or XXE, make a request to http://169.254.169.254/latest/meta-data/.  <br>Bonus points for http://169.254.169.254/latest/meta-data/iam/security-credentials/<br><br>Reporting Requirements:<br>Always create a separate finding for the reflection point.  Show the output from the SSRF.<br>","remediationInstructions":"To prevent unauthorized access to the service, remediate the underlying issues that were exploited to access the service.<br><br>Disable IMDS if it's not required. <br><code>aws ec2 modify-instance-metadata-options -instance-id &lt;instance-id&gt; -http-endpoint disabled<br></code><br>If IMDS is required, enable IMDS v2 and disable IMDS v1. Any roles assigned to the affected EC2 instance should also be evaluated, and any unnecessary permissions removed.<br><code>aws ec2 modify-instance-metadata-options -instance-id &lt;INSTANCE-ID&gt; -profile &lt;AWS_PROFILE&gt; -http-endpoint enabled -http-token required<br></code><br>","name":"Sensitive Information Disclosure – AWS Metadata Service","sourceId":"M:bbf512d2-349e-e711-80fd-ecf4bbd04083","severity":"High","businessImpact":"Unauthorized access to the metadata service may result sensitive information disclosure. The disclosed information may be used in further attacks against the AWS account.","description":"AWS provides a metadata service for fetching metadata information from an AWS resource.  This metadata may include credentials for the instance and any startup scripts used to provision it.  If an attacker can can query this service, for example by exploiting server-side request forgery, they may gain access to sensitive information.<br>"}}}