{"default_url":null,"content":{"state":0,"taskInstructions":null,"references":[],"isTaskInstructionsVisible":true,"isCommentMandatory":false,"fields":[],"masterFinding":{"id":21980,"exploitInstructions":"","verificationInstructions":"Review the group the local or domain user is associated with to determine if they have any administrative privileges.<br>","remediationInstructions":"Do not grant administrative or excessive privileges to database service accounts. Configure the database services using the principle of least privilege. Services should be configured to use the 'local service' account or a 'domain' account with only the privileges necessary for the database service account to run.   <br><br>Below are Microsoft's recommendations for MSSQL service configurations:<br><br><b>Domain User Account</b><br>If the service must interact with network services, access domain resources like file shares or if it uses linked server connections to other computers running SQL Server, use a minimally-privileged domain account. Many server-to-server activities can be performed only with a domain user account. This account should be pre-created by domain administration in the environment.<br><br><b>Local Service Account</b><br>The Local Service account is a built-in account that has the same level of access to resources and objects as members of the Users group. This limited access helps safeguard the system if individual services or processes are compromised. Services that run as the Local Service account access network resources as a null session without credentials. Be aware that the Local Service account is not supported for the SQL Server or SQL Server Agent services. The actual name of the account is \"<code>NT AUTHORITY\\LocalService</code>\".<br>","name":"Excessive Privileges - Database Service Account","sourceId":"M:21980","severity":"Medium","businessImpact":"Excessive privileges on the database server allow database queries to run operating system commands that could lead to the compromise of the target server. As a result, attackers, and database administrators may have the ability to completely compromise the confidentiality, integrity, and availability of the entire domain and its resources.  In the event of an incident revenue could be loss due to brand damage, fines, and penalties.","description":"The database service account is running with excessive privileges.<br><b>Note: </b>This issues was only tested on a sample set of systems, and may exist on other database servers in the network.<br>"}}}